---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendingDetailType.RadialDimensionTypeId
source: html/8153e630-206d-bdbb-dad3-764316ece9ca.htm
---
# Autodesk.Revit.DB.Structure.RebarBendingDetailType.RadialDimensionTypeId Property

Identifies the Id of the radial dimension type which is used to show dimensions.

## Syntax (C#)
```csharp
public ElementId RadialDimensionTypeId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property:
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null